dotfiles/emacs.d/emacs-config.org
;;; emacs-config.org: Main file for Emacs customizations
;;
;; 24 Dec 2021 -- Bob Yantosca -- yantosca@seas.harvard.edu
;;
;; This file is loaded by init.el, which issues a call to
;;(org-babel-load-file ~./emacs.d/emacs-config.org)
;;
;; You may edit this file as you wish.  Emacs-lisp code needs to go in
;; the designated blocks.  These commands will be executed upon
;; loading and then will be saved to an emacs-config.el file.
;;

#+TITLE: Bob Yantosca's Emacs Configuration

* Global toggles

This section defines global variables that are used to toggle other
settings further down in this initialization file.

** Graphical backend library

Select athena/X11 (t) or GTK (nil) as the graphical display package.

#+BEGIN_SRC emacs-lisp
  (setq enable-athena-backend nil)
#+END_SRC

** Number of frames

Decide whether to use 1 or 2 vertical frames at startup.

#+BEGIN_SRC emacs-lisp
  (setq enable-two-vertical-frames nil)
#+END_SRC

** Vterm

Enable vterm terminal emulation.

#+BEGIN_SRC emacs-lisp
  {%@@ if profile == "bender" @@%}
  (setq enable-vterm nil)
  {%@@ else @@%}
  (setq enable-vterm t)
  {%@@ endif @@%}
#+END_SRC


* Externals

This section loads external packages or configuration files that are
contained as part of this emacs-config distribution.  These are stored
in the elpa/ and elisp/ subfolders.

** External configurations

The "elisp" folder contains Emacs-lisp files from
other packages obtained via the internet.

#+BEGIN_SRC emacs-lisp
  (org-babel-load-file "~/.emacs.d/emacs-config/elisp/elisp.org")
#+END_SRC

** External packages

Load the initialization file in the elpa subdirectory, which will
load external packages such as color-theme and yasnippet.

#+BEGIN_SRC emacs-lisp
  (org-babel-load-file "~/.emacs.d/emacs-config/elpa/elpa.org")
#+END_SRC


* Display

This section contains settings for display options.

** Date and time

Display date and time in the info bar ("mode line")


#+BEGIN_SRC emacs-lisp
  (setq display-time-day-and-date t)
  (setq display-time-string-forms
        (quote
         ((if (and (not display-time-format)
                   display-time-day-and-date)
              (format-time-string "%a %b %e   " now) "  ")
          (format-time-string
           (or display-time-format
               (if display-time-24hr-format "%H:%M" "%-I:%M%p")) now)
          ))
        )
  (display-time)
#+END_SRC

Display a timestamp in a buffer


#+BEGIN_SRC emacs-lisp
(defun insert-timestamp ()
  "Insert a nicely formatted date string."
  (interactive)
  (insert (format-time-string "!  %e %b %Y - R. Yantosca - ")))
#+END_SRC

Customized insertion of timestamp (function is defined below in miscella.)

#+BEGIN_SRC emacs-lisp
(fset 'macrotimestamp
      [?\M-x ?i ?n ?s ?e ?r ?t ?- ?t ?i ?m ?e ?s ?t tab return return left ? ])

#+END_SRC

** Font

Select a default font (Emacs with GTK backend only)

NOTE: If using athena/X11 as the backend, then the default font can be
set with the emacs.Font specification in your ~/.Xresources file.

#+BEGIN_SRC emacs-lisp
  (unless enable-athena-backend
    (when (display-graphic-p)
      (set-face-font
       'default
       {%@@ if profile == "bender" @@%}
       "-*-DejaVuSansMono-Bold-R-*-*-*-100-*-*-*-*-iso8859-1")))
       {%@@ elif profile == "calculon" @@%}
       "-*-source code pro-Bold-R-*-*-*-160-*-*-*-*-iso8859-1")))
       {%@@ elif profile == "cygwin" @@%}
       "-*-DejaVuSansMono-Bold-R-*-*-*-120-*-*-*-*-iso8859-1")))
       {%@@ elif profile == "hypnotoad" @@%}
       "-*-DejaVuSansMono-Bold-R-*-*-*-100-*-*-*-*-iso8859-1")))
       {%@@ elif profile == "zoidberg" @@%}
       "-*-DejaVuSansMono-Bold-R-*-*-*-120-*-*-*-*-iso8859-1")))
       {%@@ endif @@%}
#+END_SRC

** Frames

Use a single frame at startup).

#+BEGIN_SRC emacs-lisp
  (unless enable-two-vertical-frames
    (set-frame-height (selected-frame) 41) ;; 40 lines
    (set-frame-width  (selected-frame) 81) ;; 80 cols
  )
#+END_SRC

Use two vertical frames at startup.

#+BEGIN_SRC emacs-lisp
  (when enable-two-vertical-frames
   (set-frame-height (selected-frame) 41)  ;; 40 lines
   (set-frame-width  (selected-frame) 164) ;; 164 cols
   (split-window-horizontally)
  )
#+END_SRC

** Line and column numbers

Display line and column numbers in bottom bar

#+BEGIN_SRC emacs-lisp
  (setq-default line-number-mode   t)
  (setq-default column-number-mode t)
#+END_SRC

** Scroll bar

Set the vertical scroll bar on the left
This will not take effect if running emacs -nw.

#+BEGIN_SRC emacs-lisp
(when (display-graphic-p)
  (set-scroll-bar-mode 'left))
#+END_SRC

** Splash screen

Do not show the splash screen at startup.

#+BEGIN_SRC emacs-lisp
  (setq inhibit-splash-screen t)   ;; not working w/ 21.4
  (setq inhibit-startup-message t) ;; working w/ 21.4
#+END_SRC

** Top title

Display path name in window title.

#+BEGIN_SRC emacs-lisp
  (setq frame-title-format "%S: %f")
#+END_SRC

** User input

Set C-k to kill the entire line.

#+BEGIN_SRC emacs-lisp
  (setq kill-whole-line t)
#+END_SRC

Enable multiple minibuffers.  If you don't do this, then you
can't do things like search the minibuffer history with M-s.

#+BEGIN_SRC emacs-lisp
  (setq minibuffer-max-depth nil)
#+END_SRC

To answer Y/N instead of YES/NO RET when asked for confirmation
NOTE: not for newbies!

#+BEGIN_SRC emacs-lisp
  (defalias 'yes-or-no-p 'y-or-n-p)
#+END_SRC

** Visual bell

Subtly flash the mode line when an exception (e.g. compiler warning)
occurs.  This is less annoying than the audible bell.

#+BEGIN_SRC emacs-lisp
  (setq visible-bell nil
        ring-bell-function 'flash-mode-line)
  (defun flash-mode-line ()
    (invert-face 'mode-line)
    (run-with-timer 0.1 nil #'invert-face 'mode-line))
#+END_SRC


* General settings

This section contains various settings.

** Custom variables

#+BEGIN_SRC emacs-lisp
(custom-set-variables
 ;; custom-set-variables was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 '(auto-compression-mode t nil (jka-compr))
 '(case-fold-search t)
 '(column-number-mode t)
 '(current-language-environment "ASCII")
 '(display-time-mode t)
 '(global-font-lock-mode t nil (font-lock))
 '(package-selected-packages '(better-shell magit yasnippet-classic-snippets))
 '(query-user-mail-address nil)
 '(user-mail-address "yantosca@seas.harvard.edu"))
#+END_SRC

** Backup and autosave

Various settings for backing up and autosaving.

#+BEGIN_SRC emacs-lisp
  (setq backup-by-copying t)
  (setq delete-old-versions t)
  (setq kept-new-versions 10)
  (setq kept-old-versions 2)
  (setq version-control t)
#+END_SRC

** Omit

;; This C-o business was working in Xemacs, but it is not in Emacs...:
;; to add ".mod" to the list of file type to omit when you do C-o in
;; Directory.

#+BEGIN_SRC emacs-lisp
  (defalias 'omitmod
    (read-kbd-macro "C-u %o.mod RET"))
#+END_SRC

Redefine the "omit" functions for Emacs in dired mode.

#+BEGIN_SRC emacs-lisp
  (fset 'omitdotfiles
        [?% ?m ?^ ?\\ ?. ?. ?* return ?k])
#+END_SRC

And this one will omit .o, .mod, ~, and . files from directory listing.

#+BEGIN_SRC emacs-lisp
  (fset 'omit-fortran
        [?% ?m ?^ ?\\ ?. ?\\ ?| ?\\ ?. ?o ?$ ?\\ ?| ?\\ ?. ?m ?o ?d ?$ ?\\ ?| ?~ ?$ return ?k])
#+END_SRC

** Repositories

Use MELPA-Stable repository for installing packages
This is the emacs default package location.

#+BEGIN_SRC emacs-lisp
  (require 'package)
  (add-to-list 'package-archives
               '("melpa-stable" . "http://stable.melpa.org/packages/") t)

#+END_SRC

** Miscellaneous

Kill process (like a tail -f) and purge output. In shell mode.

#+BEGIN_SRC emacs-lisp
(defalias 'quitnclean
  (read-kbd-macro "C-c C-\\ C-c C-o"))
#+END_SRC

Quick swapping between 2 buffers.

#+BEGIN_SRC emacs-lisp
(defalias 'swapbuffer
  (read-kbd-macro "C-x b RET"))
#+END_SRC


* Key bindings

** Buffers

Keybindings for swapping or deleting buffers.

#+BEGIN_SRC emacs-lisp
  (global-set-key [f10] 'swapbuffer)
  (global-set-key [f11] 'switch-to-buffer)
  (global-set-key [f12] 'kill-this-buffer)
#+END_SRC

** Deletion

Keybindings for deleting characters and words.

#+BEGIN_SRC emacs-lisp
  (global-set-key [(delete)]            "\C-d")
  (global-set-key [(control delete)]    'kill-word)
  (global-set-key [(control backspace)] 'backward-kill-word)
  (delete-selection-mode t)
#+END_SRC

** Ediff

Keybindings for Ediff-mode.

#+BEGIN_SRC emacs-lisp
  (global-set-key [(shift f1)] 'ediff-files)
  (global-set-key [(shift f2)] 'ediff-buffers)
  (global-set-key [(shift f3)] 'fullcleanediff)
#+END_SRC

** Editing

Keybindings for common editing commands.

#+BEGIN_SRC emacs-lisp
  (global-set-key [f1]               'kill-line)
  (global-set-key [f2]               'kill-word)
  (global-set-key [f3]               'string-rectangle)
  (global-set-key [f4]               'delete-rectangle)
  (global-set-key [f5]               'delete-trailing-whitespace)
  (global-set-key (kbd "<S-pause>")  "\M-l")
  (global-set-key (kbd "<pause>")    "\M-u")
  (global-set-key (kbd "<kp-enter>") 'goto-line)
#+END_SRC

** Modes

Keybindings to toggle major modes.

#+BEGIN_SRC emacs-lisp
  (global-set-key [(control f3)]  'c++-mode)
  (global-set-key [(control f4)]  'cmake-mode)
  (global-set-key [(control f5)]  'f90-mode)
  (global-set-key [(control f6)]  'org-mode)
  (global-set-key [(control f7)]  'makefile-mode)
  (global-set-key [(control f8)]  'shell-script-mode)
  (global-set-key [(control f9)]  'cperl-mode)
  (global-set-key [(control f10)] 'font-lock-mode)
  (global-set-key [(control f11)] 'kpp-mode)
#+END_SRC

** Navigation

Keybindings for navigation commands.

#+BEGIN_SRC emacs-lisp
  (global-set-key [(meta n)]      'scroll-n-lines-ahead)
  (global-set-key [(meta p)]      'scroll-n-lines-behind)
  (global-set-key [(control tab)] 'other-window)
#+END_SRC

** Search and replace

Keybindings for search & replace commands.

#+BEGIN_SRC emacs-lisp
  (global-set-key [f6]          'find-file)
  (global-set-key [(shift f6)]  'insert-file)
  (global-set-key [f7]          'save-buffer)
  (global-set-key [f8]          'isearch-forward)
  (global-set-key [f9]          'replace-string)
  (global-set-key [(shift f9)]  'query-replace)
#+END_SRC


* Major modes

This section contains customizations for the various major modes.

NOTE: Customizations for cmake-mode and yaml-mode may be found in
elisp/elisp.org.  This is because these modes are external add-ons.

** Default mode

Use fundamental-mode as the default mode.

#+BEGIN_SRC emacs-lisp
  (setq initial-major-mode 'fundamental-mode)
#+END_SRC

