dotfiles/emacs.d/emacs-config.el
(setq enable-athena-backend nil)

(setq enable-two-vertical-frames nil)

(setq enable-vterm t)

(org-babel-load-file "~/.emacs.d/emacs-config/elisp/elisp.org")

(org-babel-load-file "~/.emacs.d/emacs-config/elpa/elpa.org")

(setq display-time-day-and-date t)
(setq display-time-string-forms
      (quote
       ((if (and (not display-time-format)
                 display-time-day-and-date)
            (format-time-string "%a %b %e   " now) "  ")
        (format-time-string
         (or display-time-format
             (if display-time-24hr-format "%H:%M" "%-I:%M%p")) now)
        ))
      )
(display-time)

(defun insert-timestamp ()
  "Insert a nicely formatted date string."
  (interactive)
  (insert (format-time-string "!  %e %b %Y - R. Yantosca - ")))

(fset 'macrotimestamp
      [?\M-x ?i ?n ?s ?e ?r ?t ?- ?t ?i ?m ?e ?s ?t tab return return left ? ])

(unless enable-athena-backend
  (when (display-graphic-p)
    (set-face-font
     'default
     {%@@ if profile == "hypnotoad" @@%}
     "-*-DejaVuSansMono-Bold-R-*-*-*-100-*-*-*-*-iso8859-1")))
     {%@@ elif profile == "zoidberg" @@%}
     "-*-DejaVuSansMono-Bold-R-*-*-*-120-*-*-*-*-iso8859-1")))
     {%@@ elif profile == "calculon" @@%}
     "-*-source code pro-Bold-R-*-*-*-160-*-*-*-*-iso8859-1")))
     {%@@ endif @@%}

(unless enable-two-vertical-frames
  (set-frame-height (selected-frame) 41) ;; 40 lines
  (set-frame-width  (selected-frame) 81) ;; 80 cols
)

(when enable-two-vertical-frames
 (set-frame-height (selected-frame) 41)  ;; 40 lines
 (set-frame-width  (selected-frame) 164) ;; 164 cols
 (split-window-horizontally)
)

(setq-default line-number-mode   t)
(setq-default column-number-mode t)

(when (display-graphic-p)
  (set-scroll-bar-mode 'left))

(setq inhibit-splash-screen t)   ;; not working w/ 21.4
(setq inhibit-startup-message t) ;; working w/ 21.4

(setq frame-title-format "%S: %f")

(setq kill-whole-line t)

(setq minibuffer-max-depth nil)

(defalias 'yes-or-no-p 'y-or-n-p)

(setq visible-bell nil
      ring-bell-function 'flash-mode-line)
(defun flash-mode-line ()
  (invert-face 'mode-line)
  (run-with-timer 0.1 nil #'invert-face 'mode-line))

(custom-set-variables
 ;; custom-set-variables was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 '(auto-compression-mode t nil (jka-compr))
 '(case-fold-search t)
 '(column-number-mode t)
 '(current-language-environment "ASCII")
 '(display-time-mode t)
 '(global-font-lock-mode t nil (font-lock))
 '(package-selected-packages '(better-shell magit yasnippet-classic-snippets))
 '(query-user-mail-address nil)
 '(user-mail-address "yantosca@seas.harvard.edu"))

(setq backup-by-copying t)
(setq delete-old-versions t)
(setq kept-new-versions 10)
(setq kept-old-versions 2)
(setq version-control t)

(defalias 'omitmod
  (read-kbd-macro "C-u %o.mod RET"))

(fset 'omitdotfiles
      [?% ?m ?^ ?\\ ?. ?. ?* return ?k])

(fset 'omit-fortran
      [?% ?m ?^ ?\\ ?. ?\\ ?| ?\\ ?. ?o ?$ ?\\ ?| ?\\ ?. ?m ?o ?d ?$ ?\\ ?| ?~ ?$ return ?k])

(require 'package)
(add-to-list 'package-archives
             '("melpa-stable" . "http://stable.melpa.org/packages/") t)

(defalias 'quitnclean
  (read-kbd-macro "C-c C-\\ C-c C-o"))

(defalias 'swapbuffer
  (read-kbd-macro "C-x b RET"))

(global-set-key [f10] 'swapbuffer)
(global-set-key [f11] 'switch-to-buffer)
(global-set-key [f12] 'kill-this-buffer)

(global-set-key [(delete)]            "\C-d")
(global-set-key [(control delete)]    'kill-word)
(global-set-key [(control backspace)] 'backward-kill-word)
(delete-selection-mode t)

(global-set-key [(shift f1)] 'ediff-files)
(global-set-key [(shift f2)] 'ediff-buffers)
(global-set-key [(shift f3)] 'fullcleanediff)

(global-set-key [f1]               'kill-line)
(global-set-key [f2]               'kill-word)
(global-set-key [f3]               'string-rectangle)
(global-set-key [f4]               'delete-rectangle)
(global-set-key [f5]               'delete-trailing-whitespace)
(global-set-key (kbd "<S-pause>")  "\M-l")
(global-set-key (kbd "<pause>")    "\M-u")
(global-set-key (kbd "<kp-enter>") 'goto-line)

(global-set-key [(control f3)]  'c++-mode)
(global-set-key [(control f4)]  'cmake-mode)
(global-set-key [(control f5)]  'f90-mode)
(global-set-key [(control f6)]  'org-mode)
(global-set-key [(control f7)]  'makefile-mode)
(global-set-key [(control f8)]  'shell-script-mode)
(global-set-key [(control f9)]  'cperl-mode)
(global-set-key [(control f10)] 'font-lock-mode)
(global-set-key [(control f11)] 'kpp-mode)

(global-set-key [(meta n)]      'scroll-n-lines-ahead)
(global-set-key [(meta p)]      'scroll-n-lines-behind)
(global-set-key [(control tab)] 'other-window)

(global-set-key [f6]          'find-file)
(global-set-key [(shift f6)]  'insert-file)
(global-set-key [f7]          'save-buffer)
(global-set-key [f8]          'isearch-forward)
(global-set-key [f9]          'replace-string)
(global-set-key [(shift f9)]  'query-replace)

(setq initial-major-mode 'fundamental-mode)
