dotfiles/emacs.d/emacs-config.org
** Auto-assign modes

Assign major modes to certain file extensions

#+BEGIN_SRC emacs-lisp
  (setq auto-mode-alist
        (append '(("\\.cmake"      . cmake-mode)
                  ("\\.c$"         . c-mode)
                  ("\\.C$"         . c++-mode)
                  ("\\.cpp$"       . c++-mode)
                  ("\\.h$"         . c++-mode)
                  ("\\.hh$"        . c++-mode)
                  ("\\.hM$"        . c++-mode)
                  ("\\.hpp$"       . c++-mode)
                  ("\\.F$"         . fortran-mode)
                  ("\\.F90$"       . f90-mode)
                  ("\\.eqn$"       . kpp-mode)
                  ("\\.kpp$"       . kpp-mode)
                  ("\\.spc$"       . kpp-mode)
                  ("\\.H$"         . f90-mode)
                  ("\\.tex$"       . latex-mode)
                  ("\\.m$"         . matlab-mode)
                  ("\\.md$"        . markdown-mode)
                  ("\\.org$"       . org-mode)
                  ("\\.sh$"        . shell-script-mode)
                  ("\\.env$"       . shell-script-mode)
                  ("\\.pl$"        . cperl-mode)
                  ("\\.rc$"        . conf-mode)
                  ("\\.rs$"        . rust-mode)
                  ("\\.yaml$"      . yaml-mode)
                  ("\\.yml$"       . yaml-mode)
                  )auto-mode-alist))
#+END_SRC

Manually specify major-modes for certain files.

#+BEGIN_SRC emacs-lisp
  (add-to-list 'auto-mode-alist '(".bash_profile"         . shell-script-mode))
  (add-to-list 'auto-mode-alist '(".bashrc"               . shell-script-mode))
  (add-to-list 'auto-mode-alist '(".bash_aliases"         . shell-script-mode))
  (add-to-list 'auto-mode-alist '(".my_personal_settings" . shell-script-mode))
  (add-to-list 'auto-mode-alist '(".README"               . fundamental-mode))
  (add-to-list 'auto-mode-alist '("input.geos"            . conf-mode))
#+END_SRC

** auto-image-file-mode

Display images in emacs buffer.

#+BEGIN_SRC emacs-lisp
  (auto-image-file-mode)
#+END_SRC

** cperl-mode

Set indent level to 2 spaces (also in sub-blocks).

#+BEGIN_SRC emacs-lisp
  (setq perl-indent-level 2)
  (setq perl-continued-statement-offset 2)
 #+END_SRC

Create a new comment with TAB.

#+BEGIN_SRC emacs-lisp
  (setq perl-tab-to-comment t)
#+END_SRC

Matching parentheses and auto-expansion of keywords.

#+BEGIN_SRC emacs-lisp
  (setq perl-electric-parens t)
  (setq perl-electric-keywords t)
#+END_SRC

** ediff-mode

Create two Ediff windows, stacked one atop another.

#+BEGIN_SRC emacs-lisp
  (setq ediff-split-window-function 'split-window-vertically)
#+END_SRC

Set background colors for ediff-mode.

#+BEGIN_SRC emacs-lisp
  (defun update-diff-colors ()
    "update the colors for diff faces"
    (set-face-attribute 'diff-added nil
                        :foreground "black" :background "DarkSeaGreen1")
    (set-face-attribute 'diff-removed nil
                        :foreground "black" :background "RosyBrown1")
    (set-face-attribute 'diff-changed nil
                        :foreground "black" :background "wheat1"))
  (eval-after-load "diff-mode"
    '(update-diff-colors))
#+END_SRC

To restore my 2 windows setting w/ each compared file in one window.

#+BEGIN_SRC emacs-lisp
  (defalias 'clean-after-ediff
    (read-kbd-macro "C-x 1 C-x 3 C-x b RET"))
#+END_SRC

Close the two compared windows.

#+BEGIN_SRC emacs-lisp
  (defalias 'fullcleanediff
    (read-kbd-macro "<f3> <f2> <f3>"))

#+END_SRC

** font-lock-mode

Turn on global font-lock mode (which colorizes text depending on which
mode you are in).  Useful for programming.

#+BEGIN_SRC emacs-lisp
(if (fboundp 'global-font-lock-mode)
    (global-font-lock-mode 1)          ; GNU Emacs
    (setq font-lock-auto-fontify t))   ; XEmacs
#+END_SRC

** f90-mode

Define a hook so that certain things start when F90-mode starts.
Most notably, disable the electric indent mode.

#+BEGIN_SRC emacs-lisp
  (add-hook 'f90-mode-hook
            (function
             (lambda ()

               ;; use abbreviations (e.g.: "`pr" for "print")
               (setq  abbrev-mode 1)

               ; Turn off automatic indentation for Fortran mode only
               (when (fboundp 'electric-indent-mode) (electric-indent-mode -1))

               )
             )
            )
#+END_SRC

Align comments with the code.

#+BEGIN_SRC emacs-lisp
(fset 'smart-f90-tab
   [home ?  tab end])
#+END_SRC

Load f90-mode.

#+BEGIN_SRC emacs-lisp
  (require 'f90)
#+END_SRC

** fortran-mode

Add a hook to enable certain things when Fortran mode starts.
Most notably, disable electric-indent-mode.

#+BEGIN_SRC emacs-lisp
  (add-hook 'fortran-mode-hook
            (function
             (lambda ()
               (setq
                ;; use abbreviations (e.g.: ";s" for "stop")
                abbrev-mode 1
                )

               ; Turn off automatic indentation for Fortran mode only
               (when (fboundp 'electric-indent-mode) (electric-indent-mode -1))
               )
             )
  )
#+END_SRC

Load fortran-mode.

#+BEGIN_SRC emacs-lisp
  (require 'fortran)
#+END_SRC


** markdown-mode

Load markdown-mode

#+BEGIN_SRC emacs-lisp
  (require 'markdown-mode)
#+END_SRC


** org-mode

Activate org-mode

#+BEGIN_SRC emacs-lisp
  (require 'org)
#+END_SRC

Align text with section headlines.

#+BEGIN_SRC emacs-lisp
  (setq org-startup-indented t)
#+END_SRC

Don't show leading stars in outline levels.

#+BEGIN_SRC emacs-lisp
  (setq org-hide-leading-stars t)
#+END_SRC

Skip even indent levels, to space sections out little more.

#+BEGIN_SRC emacs-lisp
  (setq org-odd-levels-only t)
#+END_SRC

In source code blocks, use indentation rules corresponding to the
language's major mode (i.e. use C-style indentation for C, F90
indentation for Fortran-90, etc.).

#+BEGIN_SRC emacs-lisp
  (setq org-src-tab-acts-natively t)
#+END_SRC

Hide markup elements (bold, italic) from rendering in org-mode text.

#+BEGIN_SRC emacs-lisp
  (setq org-hide-emphasis-markers t)
#+END_SRC

Colorize TODO items that have been marked as "DONE".

#+BEGIN_SRC emacs-lisp
  (setq org-fontify-done-headline t)
#+END_SRC

Add a timestamp when each TODO item is marked as DONE.

#+BEGIN_SRC emacs-lisp
  (setq org-log-done 'time)
#+END_SRC

Use LaTeX-style syntax to insert special characters.

#+BEGIN_SRC emacs-lisp
  (setq org-pretty-entities nil)
#+END_SRC

Define keys for certain commands.

#+BEGIN_SRC emacs-lisp
  (setq org-structure-template-alist
    '(("a" . "export ascii\n")
      ("c" . "center\n")
      ("C" . "comment\n")
      ("e" . "example\n")
      ("E" . "export")
      ("h" . "export html\n")
      ("l" . "export latex\n")
      ("q" . "quote\n")
      ("s" . "src")
      ("v" . "verse\n")))
#+END_SRC

Look for org-agenda files: ~/org/home.org and ~/org/work.org

#+BEGIN_SRC emacs-lisp
  (if (file-directory-p "~/org")
      (setq org-agenda-files (list "~/org/home.org"
                                   "~/org/work.org")))
#+END_SRC

Define keybindings for org-agenda features.

#+BEGIN_SRC emacs-lisp
  (define-key global-map "\C-cl" 'org-store-link)
  (define-key global-map "\C-ca" 'org-agenda)
#+END_SRC

Set default column view headings: Task Total-Time Time-Stamp

#+BEGIN_SRC emacs-lisp
  (setq org-columns-default-format "%50ITEM(Task) %10CLOCKSUM %16TIMESTAMP_IA")
#+END_SRC


** shell-script-mode

Define a hook that will start certain things when shell-script mode
starts: The home key, cycling up & down through command history.

#+BEGIN_SRC emacs-lisp
(add-hook 'shell-mode-hook
	  '(lambda ()
             (local-set-key [home] 'comint-bol)                ;; Home key

	     (local-set-key [up]                                 ;; Cycle up
                            '(lambda () (interactive)          ;; through
                               (if (comint-after-pmark-p)      ;; command
                                   (comint-previous-input 1)   ;; history
                                 (previous-line 1))))

	     (local-set-key [down]                               ;; Cycle down
                            '(lambda () (interactive)          ;; through
                               (if (comint-after-pmark-p)      ;; command
                                   (comint-next-input 1)       ;; history
                                 (forward-line 1))))
             )
)
#+END_SRC

** text-mode

Turn-on auto-formatting in text-mode

#+BEGIN_SRC emacs-lisp
  (add-hook 'text-mode-hook 'turn-on-auto-fill)
#+END_SRC


* Motion (cursor and mouse)

** Bounce betwen parentheses

BOUNCE BETWEEN PARENTHESES
bounces from one sexp "(){}[]<>" to another (ala vi's %)
written by Joe Casadonte (joc@netaxs.com)

#+BEGIN_SRC emacs-lisp
  (defun joc-bounce-sexp ()
    "Will bounce between matching parens just like % in vi"
    (interactive)
    (let ((prev-char (char-to-string (preceding-char)))
          (next-char (char-to-string (following-char))))
          (cond ((string-match "[[{(<]" next-char) (forward-sexp 1))
                    ((string-match "[\]})>]" prev-char) (backward-sexp 1))
                    (t (error "%s" "Not on a paren, brace, or bracket")))))
  (global-set-key [(control =)] 'joc-bounce-sexp)
#+END_SRC

