dotfiles/emacs.d/emacs-config.el

(setq auto-mode-alist
      (append '(("\\.cmake"      . cmake-mode)
                ("\\.c$"         . c-mode)
                ("\\.C$"         . c++-mode)
                ("\\.hh$"        . c++-mode)
                ("\\.hpp$"       . c++-mode)
                ("\\.cpp$"       . c++-mode)
                ("\\.h$"         . c++-mode)
                ("\\.hM$"        . c++-mode)
                ("\\.F$"         . fortran-mode)
                ("\\.H$"         . f90-mode)
                ("\\.F90$"       . f90-mode)
                ("\\.tex$"       . latex-mode)
                ("\\.m$"         . matlab-mode)
                ("\\.md$"        . markdown-mode)
                ("\\.org$"       . org-mode)
                ("\\.sh$"        . shell-script-mode)
                ("\\.env$"       . shell-script-mode)
                ("\\.centos7$"   . shell-script-mode)
                ("\\.pl$"        . cperl-mode)
                ("\\.rc$"        . conf-mode)
                ("\\.yaml$"      . yaml-mode)
                ("\\.yml$"       . yaml-mode)
                )auto-mode-alist))

(add-to-list 'auto-mode-alist '(".bash_profile"         . shell-script-mode))
(add-to-list 'auto-mode-alist '(".bashrc"               . shell-script-mode))
(add-to-list 'auto-mode-alist '(".bash_aliases"         . shell-script-mode))
(add-to-list 'auto-mode-alist '(".my_personal_settings" . shell-script-mode))
(add-to-list 'auto-mode-alist '(".README"               . fundamental-mode))
(add-to-list 'auto-mode-alist '("input.geos"            . conf-mode))

(auto-image-file-mode)

(setq perl-indent-level 2)
(setq perl-continued-statement-offset 2)

(setq perl-tab-to-comment t)

(setq perl-electric-parens t)
(setq perl-electric-keywords t)

(setq ediff-split-window-function 'split-window-vertically)

(defun update-diff-colors ()
  "update the colors for diff faces"
  (set-face-attribute 'diff-added nil
                      :foreground "black" :background "DarkSeaGreen1")
  (set-face-attribute 'diff-removed nil
                      :foreground "black" :background "RosyBrown1")
  (set-face-attribute 'diff-changed nil
                      :foreground "black" :background "wheat1"))
(eval-after-load "diff-mode"
  '(update-diff-colors))

(defalias 'clean-after-ediff
  (read-kbd-macro "C-x 1 C-x 3 C-x b RET"))

(defalias 'fullcleanediff
  (read-kbd-macro "<f3> <f2> <f3>"))

(if (fboundp 'global-font-lock-mode)
    (global-font-lock-mode 1)          ; GNU Emacs
    (setq font-lock-auto-fontify t))   ; XEmacs

(add-hook 'f90-mode-hook
          (function
           (lambda ()

             ;; use abbreviations (e.g.: "`pr" for "print")
             (setq  abbrev-mode 1)

             ; Turn off automatic indentation for Fortran mode only
             (when (fboundp 'electric-indent-mode) (electric-indent-mode -1))

             )
           )
          )

(fset 'smart-f90-tab
   [home ?  tab end])

(require 'f90)

(add-hook 'fortran-mode-hook
          (function
           (lambda ()
             (setq
              ;; use abbreviations (e.g.: ";s" for "stop")
              abbrev-mode 1
              )

             ; Turn off automatic indentation for Fortran mode only
             (when (fboundp 'electric-indent-mode) (electric-indent-mode -1))
             )
           )
)

(require 'fortran)

(require 'markdown-mode)

(require 'org)

(setq org-startup-indented t)

(setq org-hide-leading-stars t)

(setq org-odd-levels-only t)

(setq org-src-tab-acts-natively t)

(setq org-hide-emphasis-markers t)

(setq org-fontify-done-headline t)

(setq org-log-done 'time)

(setq org-pretty-entities nil)

(setq org-structure-template-alist
  '(("a" . "export ascii\n")
    ("c" . "center\n")
    ("C" . "comment\n")
    ("e" . "example\n")
    ("E" . "export")
    ("h" . "export html\n")
    ("l" . "export latex\n")
    ("q" . "quote\n")
    ("s" . "src")
    ("v" . "verse\n")))

(if (file-directory-p "~/org")
    (setq org-agenda-files (list "~/org/home.org"
                                 "~/org/work.org")))

(define-key global-map "\C-cl" 'org-store-link)
(define-key global-map "\C-ca" 'org-agenda)

(setq org-columns-default-format "%50ITEM(Task) %10CLOCKSUM %16TIMESTAMP_IA")

(add-hook 'shell-mode-hook
	  '(lambda ()
             (local-set-key [home] 'comint-bol)                ;; Home key

	     (local-set-key [up]                                 ;; Cycle up
                            '(lambda () (interactive)          ;; through
                               (if (comint-after-pmark-p)      ;; command
                                   (comint-previous-input 1)   ;; history
                                 (previous-line 1))))

	     (local-set-key [down]                               ;; Cycle down
                            '(lambda () (interactive)          ;; through
                               (if (comint-after-pmark-p)      ;; command
                                   (comint-next-input 1)       ;; history
                                 (forward-line 1))))
             )
)

(add-hook 'text-mode-hook 'turn-on-auto-fill)

(defun joc-bounce-sexp ()
  "Will bounce between matching parens just like % in vi"
  (interactive)
  (let ((prev-char (char-to-string (preceding-char)))
        (next-char (char-to-string (following-char))))
        (cond ((string-match "[[{(<]" next-char) (forward-sexp 1))
                  ((string-match "[\]})>]" prev-char) (backward-sexp 1))
                  (t (error "%s" "Not on a paren, brace, or bracket")))))
(global-set-key [(control =)] 'joc-bounce-sexp)
