dotfiles/emacs.d/emacs-config.org
** Cursor scroll

Scroll up & down.

#+BEGIN_SRC emacs-lisp
  (defalias 'scroll-ahead 'scroll-up)
  (defalias 'scroll-behind 'scroll-down)
#+END_SRC

Scroll N lines up and down.

#+BEGIN_SRC emacs-lisp
  (defun scroll-n-lines-ahead (&optional n)
    "Scroll ahead N lines (1 by default)."
    (interactive "P")
    (scroll-ahead (prefix-numeric-value n)))

  (defun scroll-n-lines-behind (&optional n)
    "Scroll behind N lines (1 by default)."
    (interactive "P")
    (scroll-behind (prefix-numeric-value n)))
#+END_SRC

Scroll fast by 10 lines at a time.

#+BEGIN_SRC emacs-lisp
  (global-set-key [(control shift n)] (lambda () (interactive) (next-line 10)))
  (global-set-key [(control shift p)] (lambda () (interactive) (previous-line 10)))
#+END_SRC

Scroll only one line when cursor is at the bottom of the screen
(instead of finding the lastline suddenly in the middle).

#+BEGIN_SRC emacs-lisp
  (setq scroll-step 1)
#+END_SRC

** Mouse scroll

Scroll 3 lines at a time with the mouse wheel.

#+BEGIN_SRC emacs-lisp
  (setq mouse-wheel-scroll-amount '(3 ((shift) . 3) ((control) . nil)))
  (setq mouse-wheel-progressive-speed nil)
#+END_SRC


* Terminal emulation

This section contains options for the terminal emulation modes.

** term

Define options for the default term-mode, which is a terminal emulator
written in emacs-lisp.  This will be slower than vterm, which is a
compiled module.

Also note: if vterm is available, these options will not be applied.

See http://stackoverflow.com/questions/2886184/copy-paste-in-emacs-ansi-term-shell/2886539#2886539

#+BEGIN_SRC emacs-lisp
  (unless enable-vterm
    (defun ash-term-hooks ()
      ;; dabbrev-expand in term
      (define-key term-raw-escape-map "/"
        (lambda ()
          (interactive)
          (let ((beg (point)))
            (dabbrev-expand nil)
            (kill-region beg (point)))
          (term-send-raw-string (substring-no-properties (current-kill 0)))))
      ;; yank in term (bound to C-c C-y)
      (define-key term-raw-escape-map "\C-y"
        (lambda ()
          ((insert )nteractive)
          (term-send-raw-string (current-kill 0)))))
    (add-hook 'term-mode-hook 'ash-term-hooks)
  )
#+END_SRC

Kill the buffer when the terminal is exited.
See: http://emacs-journey.blogspot.com.au/2012/06/improving-ansi-term.html

#+BEGIN_SRC emacs-lisp
  (unless enable-vterm
    (defadvice term-sentinel (around my-advice-term-sentinel (proc msg))
      (if (memq (process-status proc) '(signal exit))
          (let ((buffer (process-buffer proc)))
            ad-do-it
            (kill-buffer buffer))
        ad-do-it))
    (ad-activate 'term-sentinel)
    )
#+END_SRC

Always enable bash (sorry zsh...)

#+BEGIN_SRC emacs-lisp
  (unless enable-vterm
    (defvar my-term-shell "/bin/bash")
    (defadvice term (before force-bash)
      (interactive
       (list my-term-shell)))
    (ad-activate 'term)
    )
#+END_SRC

Enable UTF-8 character encoding.

#+BEGIN_SRC emacs-lisp
  (unless enable-vterm
    (defun my-term-use-utf8 ()
      (set-buffer-process-coding-system 'utf-8-unix 'utf-8-unix))
    (add-hook 'term-exec-hook 'my-term-use-utf8)
    )
#+END_SRC

Return most recently used term buffer.

#+BEGIN_SRC emacs-lisp
  (unless enable-vterm
    (defun last-term-buffer (l)
      "Return most recently used term buffer."
      (when l
            (if (eq 'term-mode (with-current-buffer (car l) major-mode))
                (car l) (last-term-buffer (cdr l)))))
  )
#+END_SRC


Switch to the term buffer last used, or create a new one if none
exists, or if the current buffer is already a term.

#+BEGIN_SRC emacs-lisp
  (unless enable-vterm
    (defun get-term ()
      (interactive)
      (let ((b (last-term-buffer (buffer-list))))
            (if (or (not b) (eq 'term-mode major-mode))
                (multi-term)
              (switch-to-buffer b))))
  )
#+END_SRC

Kill entire line with C-k

#+BEGIN_SRC emacs-lisp
  (unless enable-vterm
    (defun term-send-kill-whole-line ()
      (interactive)
      (term-send-raw-string "\C-a")
      (term-send-raw-string "\C-k"))
    )
#+END_SRC

Opens a uniquely-named terminal running bash.  Appends the terminal
number (with <>) to the name of the buffer.

#+BEGIN_SRC emacs-lisp
  (unless enable-vterm
    (defun unique-bash-term ()
      (interactive)
      (set-buffer (make-term "terminal" my-term-shell))
      (term-mode)
      (term-char-mode)
      (switch-to-buffer "*terminal*")
      (rename-uniquely)
      )
    )
#+END_SRC

Set some keybindings specific to term-mode

#+BEGIN_SRC emacs-lisp
  (unless enable-vterm
    (setq multi-term-program "/bin/bash")
    (setq term-unbind-key-list '("C-x" "<ESC>"))
    (setq term-bind-key-alist
          '(("C-c" . term-interrupt-subjob)
            ("C-p" . term-send-up)
            ("C-n" . term-send-down)
            ("C-s" . isearch-forward)
            ("C-r" . term-send-reverse-search-history)
            ("C-m" . term-send-raw)
            ("C-k" . term-send-kill-whole-line)
            ("C-y" . yank)
            ("C-_" . term-send-raw)
            ("M-f" . term-send-forward-word)
            ("M-b" . term-send-backward-word)
            ("M-K" . term-send-kill-line)
            ("M-p" . previous-line)
            ("M-n" . next-line)
            ("M-y" . yank-pop)
            ("M-." . term-send-raw-meta)))

    (global-set-key (kbd "C-q") 'unique-bash-term)
    (global-set-key (kbd "C-;") "\C-c \C-j") ;; Line mode
    (global-set-key (kbd "C-'") "\C-c \C-k") ;; Char mode
    (define-key global-map (kbd "C-x e") 'multi-term)
    )
#+END_SRC

** vterm

This section contains customizations for vterm terminal emulation
(will be activated if enable-vterm is set to t).

Look for init files in the emacs-libvterm submodule.

#+BEGIN_SRC emacs-lisp
  (when enable-vterm
    (add-to-list 'load-path "~/.emacs.d/emacs-config/emacs-libvterm")
    (require 'vterm)
  )
#+END_SRC


Kill the buffer when vterminal is exited.
See http://emacs-journey.blogspot.com.au/2012/06/improving-ansi-vterm.html

#+BEGIN_SRC emacs-lisp
  (when enable-vterm
    (defadvice vterm-sentinel (around my-advice-vterm-sentinel (proc msg))
      (if (memq (process-status proc) '(signal exit))
          (let ((buffer (process-buffer proc)))
            ad-do-it
            (kill-buffer buffer))
        ad-do-it))
    (ad-activate 'vterm-sentinel)
  )
#+END_SRC

Always use bash (sorry zsh...)

#+BEGIN_SRC emacs-lisp
  (when enable-vterm
    (defvar my-vterm-shell "/bin/bash")
    (defadvice vterm (before force-bash)
      (interactive
       (list my-vterm-shell)))
    (ad-activate 'vterm)
  )
#+END_SRC

Use UTF-8 character encoding.

#+BEGIN_SRC emacs-lisp
  (when enable-vterm
    (defun my-vterm-use-utf8 ()
      (set-buffer-process-coding-system 'utf-8-unix 'utf-8-unix))
    (add-hook 'vterm-exec-hook 'my-vterm-use-utf8)
  )
#+END_SRC

Return the most recently used vterm buffer.

#+BEGIN_SRC emacs-lisp
  (when enable-vterm
    (defun last-vterm-buffer (l)
      (when l
            (if (eq 'vterm-mode (with-current-buffer (car l) major-mode))
                (car l) (last-vterm-buffer (cdr l)))))
  )
#+END_SRC

Switch to the vterm buffer last used, or create a new one if none
exists, or if the current buffer is already a vterm.

#+BEGIN_SRC emacs-lisp
  (when enable-vterm
    (defun get-vterm ()
      (interactive)
      (let ((b (last-vterm-buffer (buffer-list))))
            (if (or (not b) (eq 'vterm-mode major-mode))
                (multi-vterm)
              (switch-to-buffer b))))
  )
#+END_SRC

Define functions for killing an entire line.

#+BEGIN_SRC emacs-lisp
  (when enable-vterm
    (defun vterm-send-kill-whole-line ()
      (interactive)
      (vterm-send-raw-string "\C-a")
      (vterm-send-raw-string "\C-k"))
    (defun vterm-send-kill-line ()
      (interactive)
      (vterm-send-raw-string "\C-k"))
  )
#+END_SRC

Open a uniquely-named vterminal.

#+BEGIN_SRC emacs-lisp
  (when enable-vterm
    (defun unique-bash-vterm ()
      (interactive)
      (vterm)
      (vterm-send-key "<escape>")
      (rename-uniquely))
  )
#+END_SRC

Set some vterm-specific keybindings.

#+BEGIN_SRC emacs-lisp
  (when enable-vterm
    (global-set-key [(control f1)] 'unique-bash-vterm)
    (global-set-key (kbd "C-q") 'unique-bash-vterm)
    (define-key global-map (kbd "C-x e") 'multi-vterm)
  )
#+END_SRC
