dotfiles/emacs.d/emacs-config.el

(defalias 'scroll-ahead 'scroll-up)
(defalias 'scroll-behind 'scroll-down)

(defun scroll-n-lines-ahead (&optional n)
  "Scroll ahead N lines (1 by default)."
  (interactive "P")
  (scroll-ahead (prefix-numeric-value n)))

(defun scroll-n-lines-behind (&optional n)
  "Scroll behind N lines (1 by default)."
  (interactive "P")
  (scroll-behind (prefix-numeric-value n)))

(global-set-key [(control shift n)] (lambda () (interactive) (next-line 10)))
(global-set-key [(control shift p)] (lambda () (interactive) (previous-line 10)))

(setq scroll-step 1)

(setq mouse-wheel-scroll-amount '(3 ((shift) . 3) ((control) . nil)))
(setq mouse-wheel-progressive-speed nil)

(unless enable-vterm
  (defun ash-term-hooks ()
    ;; dabbrev-expand in term
    (define-key term-raw-escape-map "/"
      (lambda ()
        (interactive)
        (let ((beg (point)))
          (dabbrev-expand nil)
          (kill-region beg (point)))
        (term-send-raw-string (substring-no-properties (current-kill 0)))))
    ;; yank in term (bound to C-c C-y)
    (define-key term-raw-escape-map "\C-y"
      (lambda ()
        ((insert )nteractive)
        (term-send-raw-string (current-kill 0)))))
  (add-hook 'term-mode-hook 'ash-term-hooks)
)

(unless enable-vterm
  (defadvice term-sentinel (around my-advice-term-sentinel (proc msg))
    (if (memq (process-status proc) '(signal exit))
        (let ((buffer (process-buffer proc)))
          ad-do-it
          (kill-buffer buffer))
      ad-do-it))
  (ad-activate 'term-sentinel)
  )

(unless enable-vterm
  (defvar my-term-shell "/bin/bash")
  (defadvice term (before force-bash)
    (interactive
     (list my-term-shell)))
  (ad-activate 'term)
  )

(unless enable-vterm
  (defun my-term-use-utf8 ()
    (set-buffer-process-coding-system 'utf-8-unix 'utf-8-unix))
  (add-hook 'term-exec-hook 'my-term-use-utf8)
  )

(unless enable-vterm
  (defun last-term-buffer (l)
    "Return most recently used term buffer."
    (when l
          (if (eq 'term-mode (with-current-buffer (car l) major-mode))
              (car l) (last-term-buffer (cdr l)))))
)

(unless enable-vterm
  (defun get-term ()
    (interactive)
    (let ((b (last-term-buffer (buffer-list))))
          (if (or (not b) (eq 'term-mode major-mode))
              (multi-term)
            (switch-to-buffer b))))
)

(unless enable-vterm
  (defun term-send-kill-whole-line ()
    (interactive)
    (term-send-raw-string "\C-a")
    (term-send-raw-string "\C-k"))
  )

(unless enable-vterm
  (defun unique-bash-term ()
    (interactive)
    (set-buffer (make-term "terminal" my-term-shell))
    (term-mode)
    (term-char-mode)
    (switch-to-buffer "*terminal*")
    (rename-uniquely)
    )
  )

(unless enable-vterm
  (setq multi-term-program "/bin/bash")
  (setq term-unbind-key-list '("C-x" "<ESC>"))
  (setq term-bind-key-alist
        '(("C-c" . term-interrupt-subjob)
          ("C-p" . term-send-up)
          ("C-n" . term-send-down)
          ("C-s" . isearch-forward)
          ("C-r" . term-send-reverse-search-history)
          ("C-m" . term-send-raw)
          ("C-k" . term-send-kill-whole-line)
          ("C-y" . yank)
          ("C-_" . term-send-raw)
          ("M-f" . term-send-forward-word)
          ("M-b" . term-send-backward-word)
          ("M-K" . term-send-kill-line)
          ("M-p" . previous-line)
          ("M-n" . next-line)
          ("M-y" . yank-pop)
          ("M-." . term-send-raw-meta)))

  (global-set-key (kbd "C-q") 'unique-bash-term)
  (global-set-key (kbd "C-;") "\C-c \C-j") ;; Line mode
  (global-set-key (kbd "C-'") "\C-c \C-k") ;; Char mode
  (define-key global-map (kbd "C-x e") 'multi-term)
  )

(when enable-vterm
  (add-to-list 'load-path "~/.emacs.d/emacs-config/emacs-libvterm")
  (require 'vterm)
)

(when enable-vterm
  (defadvice vterm-sentinel (around my-advice-vterm-sentinel (proc msg))
    (if (memq (process-status proc) '(signal exit))
        (let ((buffer (process-buffer proc)))
          ad-do-it
          (kill-buffer buffer))
      ad-do-it))
  (ad-activate 'vterm-sentinel)
)

(when enable-vterm
  (defvar my-vterm-shell "/bin/bash")
  (defadvice vterm (before force-bash)
    (interactive
     (list my-vterm-shell)))
  (ad-activate 'vterm)
)

(when enable-vterm
  (defun my-vterm-use-utf8 ()
    (set-buffer-process-coding-system 'utf-8-unix 'utf-8-unix))
  (add-hook 'vterm-exec-hook 'my-vterm-use-utf8)
)

(when enable-vterm
  (defun last-vterm-buffer (l)
    (when l
          (if (eq 'vterm-mode (with-current-buffer (car l) major-mode))
              (car l) (last-vterm-buffer (cdr l)))))
)

(when enable-vterm
  (defun get-vterm ()
    (interactive)
    (let ((b (last-vterm-buffer (buffer-list))))
          (if (or (not b) (eq 'vterm-mode major-mode))
              (multi-vterm)
            (switch-to-buffer b))))
)

(when enable-vterm
  (defun vterm-send-kill-whole-line ()
    (interactive)
    (vterm-send-raw-string "\C-a")
    (vterm-send-raw-string "\C-k"))
  (defun vterm-send-kill-line ()
    (interactive)
    (vterm-send-raw-string "\C-k"))
)

(when enable-vterm
  (defun unique-bash-vterm ()
    (interactive)
    (vterm)
    (vterm-send-key "<escape>")
    (rename-uniquely))
)

(when enable-vterm
  (global-set-key [(control f1)] 'unique-bash-vterm)
  (global-set-key (kbd "C-q") 'unique-bash-vterm)
  (define-key global-map (kbd "C-x e") 'multi-vterm)
)
